
# https://docs.brew.sh/Taps
# === Taps ===

tap "colindean/fonts-nonfree"
tap "drud/ddev"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# https://github.com/Homebrew/homebrew-cask
# Homebrew Cask extends Homebrew and brings its elegance, simplicity, and speed
# to the installation and management of GUI macOS applications such as Atom and Google Chrome.
# === Casks ===

# IDEs
cask "sublime-text"
cask "visual-studio-code"

# Developer Tools
cask "docker"

# https://git-fork.com/
cask "fork"

cask "iterm2"
# cask "kdiff3"
cask "lando"
# cask "meld"
# cask "mongodb-compass-community"
cask "postman"

# Browsers
cask "google-chrome"


# Work Tools
# cask "dropbox"
# cask "evernote"
#cask "gnucash"
cask "google-backup-and-sync"
#cask "grammarly"
# cask "itsycal"
# cask "rambox"
cask "slack"
cask "zoomus"


# Media
# cask "kid3"
# cask "gimp"
# cask "handbrake"
# #cask "jubler"
# cask "paintbrush"
# cask "rawtherapee"
cask "vlc"

# Misc
# cask "steam"
cask "osxfuse"
# cask "buttercup"
# cask "colindean/fonts-nonfree/font-microsoft-office"


# === Formulae ===

# brew "openssl"
# brew "bash"
# brew "gettext"
brew "composer"
brew "coreutils"
# brew "dnsmasq", restart_service: true
# brew "ffmpeg"
brew "fish"
brew "git"
# brew "gnu-sed", args: ["with-default-names"]
# brew "gpatch"
# brew "highlight"
# brew "htop"
# brew "jq"
# brew "kubernetes-cli"
# brew "librsvg"
# brew "libxml2"
brew "readline"
# brew "mas"
# brew "mosh"
# brew "node"
# brew "ntfs-3g"
# brew "php"
# brew "pv"
# brew "python"
# brew "ripgrep"
# brew "terminal-notifier"
# brew "tig"
# brew "tree"
# brew "watch"
brew "wget"
brew "yarn"
# brew "youtube-dl"
# brew "drud/ddev/ddev"
